import javax.swing.*;

public class EmployeesList extends AddTable {
    public EmployeesList() {
        //создание списка сотрудников
        JTable jtable = new JTable(tableModel);
        tableModel.insertRow(0, new Object[]{"Иванов", "Иван", "Иванович", "23/01/1994", "муж", "89300010101", "менеджер", "продаж", "45800", "08/05/2010", "Смирнов А.В."});
        tableModel.insertRow(1, new Object[]{"Петров", "Петр", "Петрович", "14/06/1990", "муж", "89301234567", "диспетчер", "логистики", "42600", "02/04/2014", "Смирнов А.В."});
        tableModel.insertRow(2, new Object[]{"Смирнова", "Вероника", "Павловна", "07/07/1985", "жен", "89307654321", "бухгалтер", "финансов", "37900", "12/07/2008", "Смирнов А.В."});
        tableModel.insertRow(3, new Object[]{"Соколов", "Николай", "Васильевич", "29/10/1976", "муж", "89301475869", "водитель", "логистики", "62400", "20/09/2009", "Смирнов А.В."});
        tableModel.insertRow(4, new Object[]{"Воробьева", "Валентина", "Петровна", "11/05/1991", "жен", "89309876543", "менеджер", "продаж", "44700", "03/11/2012", "Смирнов А.В."});
        tableModel.insertRow(5, new Object[]{"Соболев", "Дмитрий", "Иванович", "17/01/1989", "муж", "89304875209", "водитель", "логистики", "62100", "16/10/2010", "Смирнов А.В."});
        tableModel.insertRow(6, new Object[]{"Белов", "Павел", "Константинович", "10/04/1985", "муж", "89302596585", "фин.директорв", "финансов", "50000", "08/05/2010", "Смирнов А.В."});
        tableModel.insertRow(7, new Object[]{"Ёлкин", "Олег", "Евгеньевич", "18/05/1990", "муж", "89309458632", "диспетчер", "логистики", "41900", "16/03/2011", "Смирнов А.В."});
        tableModel.insertRow(8, new Object[]{"Палкин", "Валерий", "Дмитриевич", "15/07/1987", "муж", "89304158924", "водитель", "логистики", "40500", "16/11/2014", "Смирнов А.В."});
        tableModel.insertRow(9, new Object[]{"Шишкина", "Елена", "Сергеевна", "18/12/1991", "жен", "89306582147", "секретарь", "", "39200", "05/04/2010", "Смирнов А.В."});
    }
}
